MohammadAlmarri90/Ps2-Controller-PIC18F/Ps2CONT.X/mcc_generated_files/pin_manager.h
// get/set CROSS aliases
#define CROSS_TRIS                 TRISBbits.TRISB6
#define CROSS_LAT                  LATBbits.LATB6
#define CROSS_PORT                 PORTBbits.RB6
#define CROSS_WPU                  WPUBbits.WPUB6
#define CROSS_OD                   ODCONBbits.ODCB6
#define CROSS_ANS                  ANSELBbits.ANSELB6
#define CROSS_SetHigh()            do { LATBbits.LATB6 = 1; } while(0)
#define CROSS_SetLow()             do { LATBbits.LATB6 = 0; } while(0)
#define CROSS_Toggle()             do { LATBbits.LATB6 = ~LATBbits.LATB6; } while(0)
#define CROSS_GetValue()           PORTBbits.RB6
#define CROSS_SetDigitalInput()    do { TRISBbits.TRISB6 = 1; } while(0)
#define CROSS_SetDigitalOutput()   do { TRISBbits.TRISB6 = 0; } while(0)
#define CROSS_SetPullup()          do { WPUBbits.WPUB6 = 1; } while(0)
#define CROSS_ResetPullup()        do { WPUBbits.WPUB6 = 0; } while(0)
#define CROSS_SetPushPull()        do { ODCONBbits.ODCB6 = 0; } while(0)
#define CROSS_SetOpenDrain()       do { ODCONBbits.ODCB6 = 1; } while(0)
#define CROSS_SetAnalogMode()      do { ANSELBbits.ANSELB6 = 1; } while(0)
#define CROSS_SetDigitalMode()     do { ANSELBbits.ANSELB6 = 0; } while(0)

// get/set CIRCLE aliases
#define CIRCLE_TRIS                 TRISBbits.TRISB7
#define CIRCLE_LAT                  LATBbits.LATB7
#define CIRCLE_PORT                 PORTBbits.RB7
#define CIRCLE_WPU                  WPUBbits.WPUB7
#define CIRCLE_OD                   ODCONBbits.ODCB7
#define CIRCLE_ANS                  ANSELBbits.ANSELB7
#define CIRCLE_SetHigh()            do { LATBbits.LATB7 = 1; } while(0)
#define CIRCLE_SetLow()             do { LATBbits.LATB7 = 0; } while(0)
#define CIRCLE_Toggle()             do { LATBbits.LATB7 = ~LATBbits.LATB7; } while(0)
#define CIRCLE_GetValue()           PORTBbits.RB7
#define CIRCLE_SetDigitalInput()    do { TRISBbits.TRISB7 = 1; } while(0)
#define CIRCLE_SetDigitalOutput()   do { TRISBbits.TRISB7 = 0; } while(0)
#define CIRCLE_SetPullup()          do { WPUBbits.WPUB7 = 1; } while(0)
#define CIRCLE_ResetPullup()        do { WPUBbits.WPUB7 = 0; } while(0)
#define CIRCLE_SetPushPull()        do { ODCONBbits.ODCB7 = 0; } while(0)
#define CIRCLE_SetOpenDrain()       do { ODCONBbits.ODCB7 = 1; } while(0)
#define CIRCLE_SetAnalogMode()      do { ANSELBbits.ANSELB7 = 1; } while(0)
#define CIRCLE_SetDigitalMode()     do { ANSELBbits.ANSELB7 = 0; } while(0)

// get/set START aliases
#define START_TRIS                 TRISCbits.TRISC0
#define START_LAT                  LATCbits.LATC0
#define START_PORT                 PORTCbits.RC0
#define START_WPU                  WPUCbits.WPUC0
#define START_OD                   ODCONCbits.ODCC0
#define START_ANS                  ANSELCbits.ANSELC0
#define START_SetHigh()            do { LATCbits.LATC0 = 1; } while(0)
#define START_SetLow()             do { LATCbits.LATC0 = 0; } while(0)
#define START_Toggle()             do { LATCbits.LATC0 = ~LATCbits.LATC0; } while(0)
#define START_GetValue()           PORTCbits.RC0
#define START_SetDigitalInput()    do { TRISCbits.TRISC0 = 1; } while(0)
#define START_SetDigitalOutput()   do { TRISCbits.TRISC0 = 0; } while(0)
#define START_SetPullup()          do { WPUCbits.WPUC0 = 1; } while(0)
#define START_ResetPullup()        do { WPUCbits.WPUC0 = 0; } while(0)
#define START_SetPushPull()        do { ODCONCbits.ODCC0 = 0; } while(0)
#define START_SetOpenDrain()       do { ODCONCbits.ODCC0 = 1; } while(0)
#define START_SetAnalogMode()      do { ANSELCbits.ANSELC0 = 1; } while(0)
#define START_SetDigitalMode()     do { ANSELCbits.ANSELC0 = 0; } while(0)

// get/set SELECT aliases
#define SELECT_TRIS                 TRISCbits.TRISC1
#define SELECT_LAT                  LATCbits.LATC1
#define SELECT_PORT                 PORTCbits.RC1
#define SELECT_WPU                  WPUCbits.WPUC1
#define SELECT_OD                   ODCONCbits.ODCC1
#define SELECT_ANS                  ANSELCbits.ANSELC1
#define SELECT_SetHigh()            do { LATCbits.LATC1 = 1; } while(0)
#define SELECT_SetLow()             do { LATCbits.LATC1 = 0; } while(0)
#define SELECT_Toggle()             do { LATCbits.LATC1 = ~LATCbits.LATC1; } while(0)
#define SELECT_GetValue()           PORTCbits.RC1
#define SELECT_SetDigitalInput()    do { TRISCbits.TRISC1 = 1; } while(0)
#define SELECT_SetDigitalOutput()   do { TRISCbits.TRISC1 = 0; } while(0)
#define SELECT_SetPullup()          do { WPUCbits.WPUC1 = 1; } while(0)
#define SELECT_ResetPullup()        do { WPUCbits.WPUC1 = 0; } while(0)
#define SELECT_SetPushPull()        do { ODCONCbits.ODCC1 = 0; } while(0)
#define SELECT_SetOpenDrain()       do { ODCONCbits.ODCC1 = 1; } while(0)
#define SELECT_SetAnalogMode()      do { ANSELCbits.ANSELC1 = 1; } while(0)
#define SELECT_SetDigitalMode()     do { ANSELCbits.ANSELC1 = 0; } while(0)

// get/set ANALOG aliases
#define ANALOG_TRIS                 TRISCbits.TRISC2
#define ANALOG_LAT                  LATCbits.LATC2
#define ANALOG_PORT                 PORTCbits.RC2
#define ANALOG_WPU                  WPUCbits.WPUC2
#define ANALOG_OD                   ODCONCbits.ODCC2
#define ANALOG_ANS                  ANSELCbits.ANSELC2
#define ANALOG_SetHigh()            do { LATCbits.LATC2 = 1; } while(0)
#define ANALOG_SetLow()             do { LATCbits.LATC2 = 0; } while(0)
#define ANALOG_Toggle()             do { LATCbits.LATC2 = ~LATCbits.LATC2; } while(0)
#define ANALOG_GetValue()           PORTCbits.RC2
#define ANALOG_SetDigitalInput()    do { TRISCbits.TRISC2 = 1; } while(0)
#define ANALOG_SetDigitalOutput()   do { TRISCbits.TRISC2 = 0; } while(0)
#define ANALOG_SetPullup()          do { WPUCbits.WPUC2 = 1; } while(0)
#define ANALOG_ResetPullup()        do { WPUCbits.WPUC2 = 0; } while(0)
#define ANALOG_SetPushPull()        do { ODCONCbits.ODCC2 = 0; } while(0)
#define ANALOG_SetOpenDrain()       do { ODCONCbits.ODCC2 = 1; } while(0)
#define ANALOG_SetAnalogMode()      do { ANSELCbits.ANSELC2 = 1; } while(0)
#define ANALOG_SetDigitalMode()     do { ANSELCbits.ANSELC2 = 0; } while(0)

// get/set RC3 procedures
#define RC3_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define RC3_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define RC3_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define RC3_GetValue()              PORTCbits.RC3
#define RC3_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define RC3_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define RC3_SetPullup()             do { WPUCbits.WPUC3 = 1; } while(0)
#define RC3_ResetPullup()           do { WPUCbits.WPUC3 = 0; } while(0)
#define RC3_SetAnalogMode()         do { ANSELCbits.ANSELC3 = 1; } while(0)
#define RC3_SetDigitalMode()        do { ANSELCbits.ANSELC3 = 0; } while(0)

// get/set RC4 procedures
#define RC4_SetHigh()            do { LATCbits.LATC4 = 1; } while(0)
#define RC4_SetLow()             do { LATCbits.LATC4 = 0; } while(0)
#define RC4_Toggle()             do { LATCbits.LATC4 = ~LATCbits.LATC4; } while(0)
#define RC4_GetValue()              PORTCbits.RC4
#define RC4_SetDigitalInput()    do { TRISCbits.TRISC4 = 1; } while(0)
#define RC4_SetDigitalOutput()   do { TRISCbits.TRISC4 = 0; } while(0)
#define RC4_SetPullup()             do { WPUCbits.WPUC4 = 1; } while(0)
#define RC4_ResetPullup()           do { WPUCbits.WPUC4 = 0; } while(0)
#define RC4_SetAnalogMode()         do { ANSELCbits.ANSELC4 = 1; } while(0)
#define RC4_SetDigitalMode()        do { ANSELCbits.ANSELC4 = 0; } while(0)

// get/set RC5 procedures
#define RC5_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define RC5_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define RC5_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define RC5_GetValue()              PORTCbits.RC5
#define RC5_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define RC5_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define RC5_SetPullup()             do { WPUCbits.WPUC5 = 1; } while(0)
#define RC5_ResetPullup()           do { WPUCbits.WPUC5 = 0; } while(0)
#define RC5_SetAnalogMode()         do { ANSELCbits.ANSELC5 = 1; } while(0)
#define RC5_SetDigitalMode()        do { ANSELCbits.ANSELC5 = 0; } while(0)

// get/set L1 aliases
#define L1_TRIS                 TRISCbits.TRISC6
#define L1_LAT                  LATCbits.LATC6
#define L1_PORT                 PORTCbits.RC6
#define L1_WPU                  WPUCbits.WPUC6
#define L1_OD                   ODCONCbits.ODCC6
#define L1_ANS                  ANSELCbits.ANSELC6
#define L1_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define L1_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define L1_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define L1_GetValue()           PORTCbits.RC6
#define L1_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define L1_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define L1_SetPullup()          do { WPUCbits.WPUC6 = 1; } while(0)
#define L1_ResetPullup()        do { WPUCbits.WPUC6 = 0; } while(0)
#define L1_SetPushPull()        do { ODCONCbits.ODCC6 = 0; } while(0)
#define L1_SetOpenDrain()       do { ODCONCbits.ODCC6 = 1; } while(0)
#define L1_SetAnalogMode()      do { ANSELCbits.ANSELC6 = 1; } while(0)
#define L1_SetDigitalMode()     do { ANSELCbits.ANSELC6 = 0; } while(0)

// get/set R1 aliases
#define R1_TRIS                 TRISCbits.TRISC7
#define R1_LAT                  LATCbits.LATC7
#define R1_PORT                 PORTCbits.RC7
#define R1_WPU                  WPUCbits.WPUC7
#define R1_OD                   ODCONCbits.ODCC7
#define R1_ANS                  ANSELCbits.ANSELC7
#define R1_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define R1_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define R1_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define R1_GetValue()           PORTCbits.RC7
#define R1_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define R1_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define R1_SetPullup()          do { WPUCbits.WPUC7 = 1; } while(0)
#define R1_ResetPullup()        do { WPUCbits.WPUC7 = 0; } while(0)
#define R1_SetPushPull()        do { ODCONCbits.ODCC7 = 0; } while(0)
#define R1_SetOpenDrain()       do { ODCONCbits.ODCC7 = 1; } while(0)
#define R1_SetAnalogMode()      do { ANSELCbits.ANSELC7 = 1; } while(0)
#define R1_SetDigitalMode()     do { ANSELCbits.ANSELC7 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/